Repository: h3ng3ll/Anime-radio
Catalog: lib/l10n/intl_*.arb
Languages: ru, uk

# language
source: English
ru: Русский
uk: Українська

source: General information
ru: Общая информация
uk: Загальна інформація

source: Light theme
ru: Светлая тема
uk: Світла тема

source: Dark theme
ru: Тёмная тема
uk: Темна тема

source: Now playing
ru: Сейчас играет
uk: Зараз звучить

# info_lost
source: Information about track is lost
ru: Информация о песне
uk: Інформація про пісню

# created_by
source: This app created by
ru: Создатель этого приложения
uk: Створив цю програму

source: Feedback
ru: Обратная связь
uk: Зворотній зв'язок

# img_taken_from
source: Images taken from
ru: Изображения взяты из сайта
uk: Зображення взяті із сайту

# radio_broadcasting
source: Radio is broadcasting at
ru: Радио транслируется по адресу
uk: Радіо транслюється на

source: Play recently
ru: Игралось недавно
uk: Звучало недавно

source: Saved songs
ru: Сохранённые песни
uk: Збережені треки

source: Show all played songs
ru: Показать все сыгранные песни
uk: Показати всі збережені пісні

source: Find song
ru: Искать песню
uk: Шукати пісню

source: Find
ru: Найти
uk: Знайти

# remove_songs_alert
source: Are you sure you want to remove songs ?
ru: Вы уверены что хотите удалить все песни?
uk: Вы впевнені , що ви хочете видалити всі пісні ?

source: Yes
ru: Да
uk: Так

source: No
ru: Нет
uk: Ні

source: Compositor
ru: Исполнитель
uk: Виконавець

source: Song
ru: Песня
uk: Пісня

source: When played
ru: Когда игралось
uk: Коли звучало

source: Settings
ru: Настройки
uk: Налаштування

source: Show image during playing
ru: Показывать картинку когда меняется песня
uk: Показувати зображення коли міняється пісня

source: Show table with songs
ru: Показывать таблицу из песнями
uk: Показувати таблицю із піснями

# remove_slider
source: Sound slider
ru: Удалить звуковой ползунок
uk: Видалити звуковий повзунок

source: Auto settings
ru: Автоматические настройки
uk: Автоматичні налаштування

source: Navigation
ru: Навигация
uk: Навігація

source: About app
ru: О приложении
uk: Про додаток

source: Send bugs and errors
ru: Отправляйте баги и ошибки
uk: Відправляйте баги і помилки

source: Go to settings
ru: Настройки
uk: Налаштування

source: Station
ru: Станция
uk: Станція

# more_app_info
source: More about app
ru: Больше о приложении
uk: Детальніше про додаток

source: Failed to load station
ru: Не удалось загрузить радиостанцию
uk: Не вдалося завантажити радіостанцію

# reset
source: Reset settings
ru: Сбросить настройки
uk: Скинути налаштування

source: Show unsuccessfully loaded stations
ru: Показывать станции которые не удалось загрузить
uk: Показывувати станції які не вдалось загрузити

source: No internet connection
ru: Нету подлючения к интернету
uk: Немає підключення до Інтернету

source: Image successfully has been saved to
ru: Изображение было успешно сохранено в
uk: Зображення успішно було збережено в

source: Okay
ru: Хорошо
uk: Добре

# storage_permission_have_not_granted
source: Storage permission haven't been granted
ru: Доступ хранилищу для сохранения не был предоставлен
uk: Доступ до сховища не був отриманий

source: Exit
ru: Выйти
uk: Вийти

source: All songs
ru: Все песни
uk: Всі пісні

source: Favorite songs
ru: Любимые песни
uk: Любимі пісні

source: All stations
ru: Все станции
uk: Всі станції

source: Favorite stations
ru: Любимые станции
uk: Улюблені станції

source: Version
ru: Версия
uk: Версія

# failed_to_save_image
source: Failed to save image to
ru: Не удалось сохранить изображение в
uk: Не вдалося зберегти зображення в

source: Apply
ru: Применить
uk: Застосувати

source: Genre
ru: Жанр
uk: Жанр

# by_genre
source: Genre
ru: Жанру
uk: Жанру

source: Sort by
ru: Отсортировать по
uk: Сортувати по

source: Location
ru: Расположение
uk: Місцезнаходження

source: by Location
ru: Расположению
uk: Місцезнаходженню

source: Failed to load an image
ru: Не удалось загрузить изображение
uk: Не вдалося завантажити зображення

# this_station_is_not_grant_inforation_about_played_track
source: This station isn't grant information about played track
ru: Эта станция не предоставляет информацию о играющей песни
uk: Ця станція не дає інформацію про пісню що грає

source: Clear
ru: Очистить
uk: Очистити

source: Disable all animations
ru: Отключить все анимации.
uk: Відключити всі анімації

source: Disable image animation
ru: Отключить анимацию изображения
uk: Відключити анімацію зображення

source: Disable loading station animations
ru: Оключить анимации загрузки станции
uk: Відключити анімацію загрузки станції

source: Show genres of image
ru: Отбражаемые жанры изображения
uk: Жанри зображень

source: Change
ru: Изменить
uk: Змінити

# here_is_must_be_even_one_selected_item
source: Here's must be even one selected item or you can disable all options which is located above.
ru: Должен быть хотя бы один выбран жанр или вы можете отключить все , отключивши функцию выше .
uk: Повинен бути хоча б один жанр або ви можете відключити їх усі , встановивши перемикач у положення 'виключено'
